<img src="images\Logo_UCLL_ENG_RGB.png" style="background-color:white;" />

# Data Analytics & Machine learning

Lecturers: Aim√©e Lynn Backiel, Chidi Nweke, Daan Nijs

Academic year 2023-2024

## Lab 2: Introduction to the case and Pandas

### Lecture outline

1. Recap last week
2. Introduction to the case
3. Data exploration using Pandas
   1. Univariate analysis
   2. Bivariate analysis

### Recap of last lecture(s)

#### Week 1

1. We ensured we had a valid Python installation.
2. We learnt what a virtual environment is:
   * Isolated Python executable and packages.
   * We created a virtual environment.
3. Absolute path vs relative path recap.
4. Recap of data structures in Python

### The case

Ada Turing Travelogue, or as everyone calls her, Ada just started working part time at her parents travel agency. She has a keen understanding and interest of everything related to applied computer science ranging from server & system management to full stack software development. Through database foundations she already understands how to query data and programming 1 and 2 covered the essentials about the Python programming language. Recently she has just decided to start learning about data analytics & machine learning as well.

She uses her skills to connect to the travel agency's database where she finds many, normalized, tables. Ada recalls what she learnt in database foundations and performs all the correct joins. Afterwards she saves the data in the `data/` folder.


She finds the following dataset:

| Column Name          | Description                                                                                       |
| -------------------- | ------------------------------------------------------------------------------------------------- |
| SalesID              | Unique identifier for each sale.                                                                  |
| Age                  | Age of the traveler.                                                                              |
| Country              | Country of origin of the traveler.                                                                |
| Membership_Status    | Membership level of the traveler in the booking system; could be 'standard', 'silver', or 'gold'. |
| Previous_Purchases   | Number of previous bookings made by the traveler.                                                 |
| Destination          | Travel destination chosen by the traveler.                                                        |
| Stay_length          | Duration of stay at the destination.                                                              |
| Guests               | Number of guests traveling (including the primary traveler).                                             |
| Travel_month         | Month in which the travel is scheduled.                                                           |
| Months_before_travel | Number of months prior to travel that the booking was made.                                       |
| Earlybird_discount   | Boolean flag indicating whether the traveler received an early bird discount.                     |
| Package_Type         | Type of travel package chosen by the traveler.                                                    |
| Cost                 | Calculated cost of the travel package.                                                            |
| Margin | The cost (for the traveler) - what the travel agency pays. |
 | Additional_Services_Cost| The amount of additional services (towels, car rentals, room service, ...) that was bought during the trip. |

### Helping Ada explore the dataset

The main goal for the remainder of this lab is to explore the data. We will specifically take four columns:

* Cost
* age
* stay length
* Destination

Our goal is to find interesting relationships between them.

As was covered in the book and lecture there are to main data types in analytics: categorical and continuous data. This is a crucial first step in your analysis because it determines what methods make sense on your data.

**The goal is primarily to find out what influences the cost of the stay.**

### Introduction to Pandas

<center><img src="images\pandas_logo.png"  style="background-color:white;"></center>

Pandas stands for panel data, a type of dataset used in economics. Although this was the reason Pandas was invented, it is widely used in across analytics and one of Python's many "killer apps". Essentially, it's a package that makes Python unique compared to some of its competitors.

#### Installing Pandas


Before we start it is a good idea to check if you have pandas installed yet. You can do that with the following command in a notebook cell `!pip list`. Notice the exclamation mark (!), it allows you to run things in a code cell as it were a terminal. You can also open the terminal itself and write `pip list`.

In [ ]:
!pip list


`pip list` shows you the full set of packages you have installed. If you are making this lab from Google colab Pandas will already be installed. You can double check this with `!pip list | grep pandas`. `|` is the pipe operator which gives the result of the preceding statement to `grep` which searches the text for Pandas. You can run this on unix-based operating systems as well. If you are on Windows you can run the command: `!pip list | findstr pandas`.

In [ ]:
!pip list | findstr pandas


**‚ùó If you have a long list of packages and you are not working from google Colab that is likely an indication you're not working from a virtual environment. Follow the instructions that were listed in the beginning of the class, ask us or send us an e-mail.**

If you're working locally and have followed the instructions Pandas will not be installed yet. You can do so by running `pip install pandas` in the terminal or in a code cell (including the exclamation mark).

In [ ]:
# Uncomment to install Pandas

#!pip install pandas

#### Reading and exploring data

It's important to know that Pandas is a massive library with a lot of features. For the scope of this course you won't need a lot of it. We recommend you to look at the <a href=./Pandas_Cheat_Sheet.pdf>the cheat sheet</a> to discover what functionality Pandas has. We also recommend you to read the documentation of some of the functions we are using.

Pandas is typically imported as pd by convention. The package makes it incredibly easy to read and write data from different file formats. On top of that it comes with many operations that make working with data easy.

In [2]:
import pandas as pd # by convention

Collecting pandas
  Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
     ---------------------------------------- 11.6/11.6 MB 2.6 MB/s eta 0:00:00
Collecting numpy>=1.23.2
  Downloading numpy-2.1.2-cp311-cp311-win_amd64.whl (12.9 MB)
     ---------------------------------------- 12.9/12.9 MB 2.6 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\u0086305\documents\daml\daml course materials\daml-students-2425\daml\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1
  Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
     -------------------------------------- 508.0/508.0 kB 3.2 MB/s eta 0:00:00
Collecting tzdata>=2022.7
  Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
     -------------------------------------- 346.6/346.6 kB 2.2 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\u0086305\documents\daml\daml course materials\daml-students-2425\daml\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.2 pandas-2.2.3 pytz-2024.2 tzdata-2024.2

[notice] A new release of pip available: 22.3 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

###### üíªüìäüí°<a href="https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html"> `pd.read_csv` is used to read data from a filepath.</a>

In [3]:
travel_dataset = pd.read_csv("data/lab_2_dataset.csv")

##### ‚ùì To be sure: did we use a relative or an absolute path?

One of the first things you typically do with a dataset is print out the first few rows.

##### üíªüìäüí° <a href=https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.head.html>dataframe.head() prints out the first few lines of the dataframe.</a>

In [4]:
travel_dataset.head()

,sales_id,age,country,membership_status,previous_purchases,destination,stay_length,guests,travel_month,months_before_travel,earlybird_discount,package_Type,cost,rating,margin,additional_services_cost
0,1,47,UK,silver,1,Sydney,4,2,7,1,False,Adventure,1706.093478,6,1219.740722,291.061043
1,2,37,Italy,silver,5,Tokyo,4,2,8,4,False,Adventure,1779.956899,7,1570.387236,405.516446
2,3,49,USA,standard,2,Sydney,3,4,7,1,False,Cultural,2829.920469,6,2360.488698,285.364191
3,4,62,Spain,silver,2,Cape Town,7,2,1,3,True,Adventure,2789.528342,7,2315.659102,747.533464
4,5,36,Germany,silver,3,Paris,9,3,2,7,False,Adventure,5357.997309,5,5042.139271,1117.092552

Accessing the columns is equally trivial.

In [ ]:
travel_dataset.columns

Before we proceed we will take a subset of our dataset cost, age, stay length and destination. Doing so is similar to working with dictionaries.

In [ ]:
travel_dataset["country"]

In [ ]:
travel_dataset["age"]

In [ ]:
travel_dataset["stay_length"]

To get multiple columns at once we need to pass in a list of columns

In [ ]:
columns = ["country", "stay_length", "age", "cost"]
travel_dataset_subset = travel_dataset[columns]
travel_dataset_subset

#### Intermezzo: Series and Dataframes are mutable

The first important thing to notice about Pandas dataframe is that they are a combination of Pandas Series (columns).

<center><img src="images\df_vs_series.png"  style="background-color:white;"></center>

**‚ùó Pandas Series and Dataframes are mutable. This can be a big source of frustration and unexpected behavior.**

In [ ]:
# The easiest way to make a dataframe is start from a list of dictionaries

students = [{"name": "Omar", "age": 21}, {"name": "Alisha", "age":19}, {"name": "Joost", "age":18}]
students_df = pd.DataFrame(students)
students_df

In [ ]:
type(students_df)

In [ ]:
students_df["name"]

In [ ]:
type(students_df["name"])

In [ ]:
student_names = students_df["name"]
student_names

In [ ]:
# Pandas complains about you doing this.
student_names[1] = "Katrien"
student_names

In [ ]:
students_df

In [ ]:
# If you want to try something out an want to "keep" your original data
students_copy = students_df.copy()
student_names = students_copy["name"]
student_names[1] = "Alisha"
students_copy

In [ ]:
students_df

As you can see Pandas is warning us of this behavior with *"A value is trying to be set on a copy of a slice from a DataFrame"*. The documentation and error message aren't particularly helpful for beginners but the small example above demonstrates what they mean and why it's a problem.

#### Data exploration: univariate

After that short detour we now know that changing our subset `travel_dataset_subset` means we also change our original dataset. We will continue the exploration of our country, stay_length, age and cost variables.

1. We will start with a univariate analysis, which means we will explore one (uni) variable (variate) at a time. 
2. Later on we will move to two (bi) variables (variate) analyses 
3. We round it up with methods that are able to do multivariate analysis.

Recall that 

1. **Categorical variables** represent categories or labels (e.g., colors, genders). 
2. **Numeric variables** represent quantities and can be ordered or measured (e.g., age, height). 
3. There is a special case called **Ordinal variables**, these are categories where there is a meaningful order (e.g., clothes sizes: small, medium and large).

##### ‚ùì Which variables are categorical and which are numeric?

##### ‚ùì Do you recall how we can "summarize" or describe numeric variables?

##### ‚ùì Carry this analysis out on the numeric variable(s).

üíªüìäüí° TIP: the names of the functions are intuitive. For instance `dataframe[column].min()` gets the minimum of that column. It is equivalent to `select min(column) from dataframe` in SQL. Knowing SQL makes it easy to translate back and forth.

üíªüìäüí° TIP: become good friends with the <a href=./Pandas_Cheat_Sheet.pdf>the cheat sheet</a> and the documentation

##### ‚ùì Doing this one by one gets quite tedious. Is there any other way listed on the cheat sheet to do this for all variables at once?

##### ‚ùì Carry this analysis out on the categorical variable(s).

üíªüìäüí° TIP: `dataframe[column].value_counts()` is a very powerful method. It is equivalent to `select column, count(column) from dataframe group by column`. If you forget `value_counts()` exists you can get there using your SQL knowledge. `dataframe.groupby("column").count()` also gets you very close.

In [5]:
travel_dataset.describe()

,sales_id,age,previous_purchases,stay_length,guests,travel_month,months_before_travel,cost,rating,margin,additional_services_cost
count,10000.00000,10000.00000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000
mean,5000.50000,39.97590,3.477200,10.491400,2.475600,5.892800,3.552000,5750.918556,6.207400,5178.093586,1159.001002
std,2886.89568,14.00164,1.894001,7.053517,1.159801,3.698307,3.052708,5035.339341,0.953665,4812.321464,1112.082664
min,1.00000,18.00000,0.000000,1.000000,1.000000,1.000000,1.000000,94.285463,4.000000,-432.795923,-48.638258
25%,2500.75000,29.00000,2.000000,5.000000,2.000000,2.000000,1.000000,2293.912845,5.000000,1812.318019,417.602831
50%,5000.50000,39.00000,3.000000,9.000000,2.000000,6.000000,3.000000,4227.457435,6.000000,3763.087230,824.549900
75%,7500.25000,50.00000,5.000000,14.000000,3.000000,8.000000,5.000000,7561.063091,7.000000,6930.931556,1522.108462
max,10000.00000,80.00000,13.000000,68.000000,5.000000,12.000000,28.000000,56969.498138,9.000000,51197.505870,10991.199521

#### Data exploration: bivariate

We will always also look at the combinations of variables and see if those have interesting insights.

##### ‚ùì What pairs of variables do you think are interesting to look at?

##### ‚ùì What methods can you use to do this?

##### ‚ùì Carry out these analyses

üíªüìäüí° TIP: Things like  `dataframe[["column1", "column2"]].groupby("column1").mean()` are valid Pandas. In SQL this would be `select column1, mean(column2) from dataframe group by column 1`

That rounds up today's session. In the next session we will cover plotting in Python using Matplotlib and Seaborn. Right now all of your data analysis has been tables but plots are a lot more ergonomic to present your results in.